# Clash Bot Workflow PR Details

## Lambda Function Versions used

| Lambda Function | Artifact Version |
| --------------- | ---------------- |
| Event Publisher | 187 |
| Event Handler | 191 |
| Event Notifier | 192 |
| Create Team | 187 |
| Retrieve Teams | 187 |
| Is Tournament Eligible | 188 |

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
data.aws_acm_certificate.issued: Reading...
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=tournament_eligibility_exec_role-development]
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.retrieve_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=retrieve_team_exec_role-development]
module.event_publisher_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_publisher_exec_role-development]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.create_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=create_team_exec_role-development]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.create_team_step_function.data.aws_caller_identity.current: Reading...
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.event_handler_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_handler_exec_role-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=create-team-development]
module.event_publisher_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-publisher-Policy-development]
module.event_publisher_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-publisher-development]
module.create_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-Policy-development]
module.tournament_eligibility_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/tournament-eligibility-Policy-development]
module.retrieve_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-team-Policy-development]
module.retrieve_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=retrieve-team-development]
module.create_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-team-development]
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Refreshing state... [id=tournament-eligibility-development]
module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_publisher_exec_role-development-20231118000957978600000002]
module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=tournament_eligibility_exec_role-development-20231118000958741200000004]
module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=retrieve_team_exec_role-development-20231118000958206700000003]
module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=create_team_exec_role-development-20231118000957795600000001]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Reading...
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Read complete after 0s [id=2997044669]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
module.create_team_step_function.aws_iam_policy.service["lambda"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-lambda]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
module.create_team_step_function.aws_iam_policy_attachment.service["lambda"]: Refreshing state... [id=create-team-development-lambda]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=create-team-development-dynamodb]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]
aws_lambda_permission.create_team_permission: Refreshing state... [id=CreateTeamPermission-development]
aws_lambda_permission.tournament_eligibility_permission: Refreshing state... [id=TournamentEligibilityPermission-development]
module.event_handler_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-handler-Policy-development]
module.event_handler_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-handler-development]
module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_handler_exec_role-development-20231118001013189900000005]
aws_lambda_event_source_mapping.event_handler_sqs_trigger: Refreshing state... [id=7fd6c898-c397-49fa-b143-76747922a919]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.clash_bot_websocket_api will be created
  + resource "aws_apigatewayv2_api" "clash_bot_websocket_api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "clash-bot-workflow-ws-development"
      + protocol_type                = "WEBSOCKET"
      + route_selection_expression   = "$request.body.action"
      + tags_all                     = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_apigatewayv2_integration.clash_bot_websocket_api_integration will be created
  + resource "aws_apigatewayv2_integration" "clash_bot_websocket_api_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Lambda integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.clash_bot_connection_route will be created
  + resource "aws_apigatewayv2_route" "clash_bot_connection_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$connect"
      + target             = (known after apply)
    }

  # aws_lambda_permission.clash_bot_ws_lambda_permission will be created
  + resource "aws_lambda_permission" "clash_bot_ws_lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "event-notifier-development"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.event_notifier_lambda.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy for the event-notifier lambda function."
      + id          = (known after apply)
      + name        = "event-notifier-Policy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.event_notifier_lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "event_notifier_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.event_notifier_lambda.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "event_notifier_exec_role-development"
    }

  # module.event_notifier_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "event-notifier-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/event-notifier/development/artifact-192.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.events_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "connectionId"
      + id               = (known after apply)
      + name             = "clash-bot-events-development"
      + range_key        = "context"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-bot-events-development"
        }
      + tags_all         = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
          + "Name"        = "clash-bot-events-development"
        }
      + write_capacity   = 5

      + attribute {
          + name = "connectionId"
          + type = "S"
        }
      + attribute {
          + name = "context"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
aws_apigatewayv2_api.clash_bot_websocket_api: Creating...
module.event_notifier_lambda.aws_iam_role.lambda_exec_role: Creating...
module.events_table.aws_dynamodb_table.this[0]: Creating...
module.event_notifier_lambda.aws_iam_role.lambda_exec_role: Creation complete after 1s [id=event_notifier_exec_role-development]
aws_apigatewayv2_api.clash_bot_websocket_api: Creation complete after 1s [id=k10wm04op6]
module.events_table.aws_dynamodb_table.this[0]: Creation complete after 7s [id=clash-bot-events-development]
module.event_notifier_lambda.aws_iam_policy.policy: Creating...
module.event_notifier_lambda.aws_lambda_function.lambda: Creating...
module.event_notifier_lambda.aws_iam_policy.policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/event-notifier-Policy-development]
module.event_notifier_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creating...
module.event_notifier_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Creation complete after 0s [id=event_notifier_exec_role-development-20231119090315299300000001]
module.event_notifier_lambda.aws_lambda_function.lambda: Creation complete after 6s [id=event-notifier-development]
aws_lambda_permission.clash_bot_ws_lambda_permission: Creating...
aws_apigatewayv2_integration.clash_bot_websocket_api_integration: Creating...
aws_lambda_permission.clash_bot_ws_lambda_permission: Creation complete after 1s [id=terraform-20231119090321485100000002]
aws_apigatewayv2_integration.clash_bot_websocket_api_integration: Creation complete after 1s [id=dczcm2o]
aws_apigatewayv2_route.clash_bot_connection_route: Creating...
aws_apigatewayv2_route.clash_bot_connection_route: Creation complete after 0s [id=w7fedob]

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
create-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:create-team-development"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-handler-development"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-publisher-development"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
retrieve-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:retrieve-team-development"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
tournament-eligibility-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:tournament-eligibility-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*